Revit 2024 API
CylindricalHelix.YVector Property
The Y direction vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ YVector { get; }
Visual Basic
Public ReadOnly Property YVector As XYZ
	Get
Visual C++
public:
property XYZ^ YVector {
	XYZ^ get ();
}
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace